#ifndef __BSP_HAL_TIME_H__
#define __BSP_HAL_TIME_H__

/* 包含头文件 ----------------------------------------------------------------*/
#include "mytype.h"
#include "tim.h"
/* 类型定义 ------------------------------------------------------------------*/

/* 宏定义 --------------------------------------------------------------------*/
#define TIMER htim3
/* 扩展变量 ------------------------------------------------------------------*/
/* 函数声明 ------------------------------------------------------------------*/
void Timer_SetHandler(VoidFuncVoid func);
void Timer2_SetHandler(VoidFuncVoid func);


#endif  // __BSP_HAL_TIME_H__

